app/controllers/coupons_controller.rb

  def index
    @coupons = Coupon.all
---
SELECT "coupons".* FROM "coupons"

  def show
    @coupon = Coupon.find(params[:id])
---
SELECT "coupons".* FROM "coupons" WHERE "coupons"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @coupon = Coupon.new(params[:coupon])

    respond_to do |format|
      if @coupon.save
---
INSERT INTO "coupons" ("content", "created_at", "updated_at", "username") VALUES (?, ?, ?, ?)  [["content", "Half Prices"], ["created_at", Mon, 06 Apr 2015 00:20:38 UTC +00:00], ["updated_at", Mon, 06 Apr 2015 00:20:38 UTC +00:00], ["username", "test"]]