app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE ((full_address LIKE '%PA%' OR state LIKE '%PA%' OR city LIKE '%PA%') AND (name LIKE '%Starbucks%' OR categories LIKE '%Starbucks%'))
---
  def show
    # @user = User.find(params[:id])
    @loc_empty=false
    if params[:location].empty?
      @loc_empty=true
    end
      if params[:search]
        @users=User.find(:all, :conditions => ['(full_address LIKE ? OR state LIKE ? OR city LIKE ?) AND (name LIKE ? OR categories LIKE ?)', "%#{params[:location]}%","%#{params[:location]}%","%#{params[:location]}%","%#{params[:search]}%","%#{params[:search]}%"])